## staging: dns
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                      NAME                                                      |
|--------|----------------------------------------------------------------------------------------------------------------|
| add    | `aws_sesv2_email_identity.custom_sending_domains[&quot;custom-sending-domain.staging.notification.cdssandbox.xyz&quot;]` |
|        | `aws_sesv2_email_identity.notification-canada-ca`                                                              |
|        | `aws_sesv2_email_identity.notification-canada-ca-receiving`                                                    |
| delete | `aws_ses_domain_identity.custom_sending_domains[&quot;custom-sending-domain.staging.notification.cdssandbox.xyz&quot;]`  |
|        | `aws_ses_domain_identity.notification-canada-ca`                                                               |
|        | `aws_ses_domain_identity.notification-canada-ca-receiving`                                                     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_ses_domain_identity.custom_sending_domains["custom-sending-domain.staging.notification.cdssandbox.xyz"] will be destroyed
  # (because aws_ses_domain_identity.custom_sending_domains is not in configuration)
  - resource "aws_ses_domain_identity" "custom_sending_domains" {
      - arn                = "arn:aws:ses:ca-central-1:239043911459:identity/custom-sending-domain.staging.notification.cdssandbox.xyz" -> null
      - domain             = "custom-sending-domain.staging.notification.cdssandbox.xyz" -> null
      - id                 = "custom-sending-domain.staging.notification.cdssandbox.xyz" -> null
      - verification_token = "fXT/J45wZcUoBSnJAwPyfnHVf5E2b7aNayCC5PeQltg=" -> null
    }

  # aws_ses_domain_identity.notification-canada-ca will be destroyed
  # (because aws_ses_domain_identity.notification-canada-ca is not in configuration)
  - resource "aws_ses_domain_identity" "notification-canada-ca" {
      - arn                = "arn:aws:ses:ca-central-1:239043911459:identity/staging.notification.cdssandbox.xyz" -> null
      - domain             = "staging.notification.cdssandbox.xyz" -> null
      - id                 = "staging.notification.cdssandbox.xyz" -> null
      - verification_token = "vJFwJM0wnPRWKFXsoiVl9/gLXFP4RL5Xfl4C9JTp3VI=" -> null
    }

  # aws_ses_domain_identity.notification-canada-ca-receiving will be destroyed
  # (because aws_ses_domain_identity.notification-canada-ca-receiving is not in configuration)
  - resource "aws_ses_domain_identity" "notification-canada-ca-receiving" {
      - arn                = "arn:aws:ses:us-east-1:239043911459:identity/staging.notification.cdssandbox.xyz" -> null
      - domain             = "staging.notification.cdssandbox.xyz" -> null
      - id                 = "staging.notification.cdssandbox.xyz" -> null
      - verification_token = "AwTGEoIByR4QGirawhDmRdJmxFO/U0fX3NMrSOJpuI4=" -> null
    }

  # aws_sesv2_email_identity.custom_sending_domains["custom-sending-domain.staging.notification.cdssandbox.xyz"] will be created
  + resource "aws_sesv2_email_identity" "custom_sending_domains" {
      + arn                         = (known after apply)
      + email_identity              = "custom-sending-domain.staging.notification.cdssandbox.xyz"
      + id                          = (known after apply)
      + identity_type               = (known after apply)
      + tags_all                    = (known after apply)
      + verified_for_sending_status = (known after apply)

      + dkim_signing_attributes (known after apply)
    }

  # aws_sesv2_email_identity.notification-canada-ca will be created
  + resource "aws_sesv2_email_identity" "notification-canada-ca" {
      + arn                         = (known after apply)
      + email_identity              = "staging.notification.cdssandbox.xyz"
      + id                          = (known after apply)
      + identity_type               = (known after apply)
      + tags_all                    = (known after apply)
      + verified_for_sending_status = (known after apply)

      + dkim_signing_attributes (known after apply)
    }

  # aws_sesv2_email_identity.notification-canada-ca-receiving will be created
  + resource "aws_sesv2_email_identity" "notification-canada-ca-receiving" {
      + arn                         = (known after apply)
      + email_identity              = "staging.notification.cdssandbox.xyz"
      + id                          = (known after apply)
      + identity_type               = (known after apply)
      + tags_all                    = (known after apply)
      + verified_for_sending_status = (known after apply)

      + dkim_signing_attributes (known after apply)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  - ses_verification                      = "vJFwJM0wnPRWKFXsoiVl9/gLXFP4RL5Xfl4C9JTp3VI=" -> null

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.dev_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.production_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.sandbox_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.scratch_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.staging_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-sandbox[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_cert_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_fqdn"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_key_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.custom_sending_domains[\"custom-sending-domain.staging.notification.cdssandbox.xyz\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.notification-canada-ca-receiving"]

33 tests, 19 passed, 14 warnings, 0 failures, 0 exceptions

```

</details>
